Revit 2027 API
ProductType Enumeration
An enumerated type containing the possible Revit product types.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ProductType
Public Enumeration ProductType
public enum class ProductType
type ProductType
Members
Member name | Value | Description
Architecture | 0 |  Architecture.
LT | 4 |  LT.
MEP | 2 |  MEP.
Revit | 3 |  Revit.
Structure | 1 |  Structure.
Unknown | 5 |  Unknown.
See Also
Reference
Autodesk.Revit.ApplicationServices Namespace